rottenpotatoes/app/controllers/movies_controller.rb

  def director
    id = params[:id]
    debugger
    this_movie = Movie.find(id)
    @movie_director = this_movie.director
    # print Movie.find(id).title + "\n"
    if @movie_director == ""
      flash[:notice] = "'#{this_movie.title}' has no director info"
      redirect_to '/movies'
    else
      @all_ratings = Movie.all_ratings
      @selected_ratings = params[:ratings] || session[:ratings] || {}

      if @selected_ratings == {}
        @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
      end

      if params[:sort] != session[:sort] or params[:ratings] != session[:ratings]
        session[:sort] = sort
        session[:ratings] = @selected_ratings
        redirect_to :sort => sort, :ratings => @selected_ratings and return
      end
      @similar_movies = Movie.find_by_director(@movie_director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies"
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]